# SetDefaultTexMap

## Description
Set the object to have default texture mapping info. Texture resource being used is set with [[VS:SetTextureRef]]. Similar to [[VS:SetDefaultTextureSpace]] except that routine has been superseded in version 2009.

```pascal
PROCEDURE SetDefaultTexMap(h : HANDLE);
```

```python
def vs.SetDefaultTexMap(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|   |

## Version
Availability: from Vectorworks14.0

## Category
* Textures